
NUMBER_RE = "[一二三四五六七八九十零百千万1234567890]"

INDENT_RE = [
    "序言",
    f"^第{NUMBER_RE}+编",
    f"^第{NUMBER_RE}+章",
    f"^第{NUMBER_RE}+节",
    "^([一二三四五六七八九十零百千万]+、.{1,15})[^。；：]$",
]

LINE_RE = INDENT_RE + [f"^第{NUMBER_RE}+条"]


DESC_REMOVE_PATTERNS = [
    r"^（",
    r"^\(",
    r"）$",
    r"\)$",
    r"^根据",
    r"^自",
]

LINE_START = f"""^({"|".join(map(lambda x: f"({x})".replace(
    NUMBER_RE, "一"), filter(lambda x: "节" not in x, LINE_RE)))})"""


REGION_CODE_MAP = {
    "北京": 170,
    "天津": 180,
    "河北": 190,
    "山西": 200,
    "内蒙古": 210,
    "辽宁": 220,
    "吉林": 230,
    "黑龙江": 240,
    "上海": 250,
    "江苏": 260,
    "浙江": 270,
    "安徽": 280,
    "福建": 290,
    "江西": 300,
    "山东": 310,
    "河南": 320,
    "湖北": 330,
    "湖南": 340,
    "广东": 350,
    "广西": 360,
    "海南": 370,
    "重庆": 380,
    "四川": 390,
    "贵州": 400,
    "云南": 410,
    "西藏": 420,
    "陕西": 430,
    "甘肃": 440,
    "青海": 450,
    "宁夏": 460,
    "新疆": 470,
}